{
  "next": 1691078400,
  "facts": [
    {
      "requestedBy": "608584543506530314",
      "fact": "Wynncraft did not always have the Shaman class! It was added in The Silent Expanse Update on December 8th 2019 but was released in the HERO beta on November 12th of the same year.",
      "id": 1,
      "lastSent": 0
    },
    {
      "requestedBy": "608584543506530314",
      "fact": "Enemies lose there aggression on you when opening chests",
      "id": 2,
      "lastSent": 1690905600
    },
    {
      "requestedBy": "608584543506530314",
      "fact": "All current Mythic items are, with a 1/142857 (7/999999) chance to drop, the rarest variant of item to be found.",
      "id": 3,
      "lastSent": 1690473600
    },
    {
      "requestedBy": "608584543506530314",
      "fact": "Detlas is Salted (one of the server owners) spelled backwards",
      "id": 4,
      "lastSent": 0
    },
    {
      "requestedBy": "608584543506530314",
      "fact": "Most of the Gathering Rods you can buy from Dungeon Merchants are used. Every rod from Tier 5 to Tier 10 is missing two points of durability from the maximum when newly bought at a dungeon, along with the Tier 4 rod from Lost Sanctuary. Interestingly, the Tier 4 rod from Underworld Crypt and the Tier 11 rods at CIB and CUR are perfectly intact\n**Source:** https://www.reddit.com/r/WynnCraft/comments/s5mt9s/strange_andor_obscure_wynncraft_facts_day_1_of_14/",
      "id": 5,
      "lastSent": 0
    },
    {
      "requestedBy": "608584543506530314",
      "fact": "In The Feathers Fly Part I and II, the Growth Accelerator Remote never starts on Left. It always, without fail, starts with a Right Click. That's to say nothing of what comes after it, though. It's just a simple fact that the remote never has you left click on the first prompt.\n**Source:** https://www.reddit.com/r/WynnCraft/comments/s6g63b/strange_andor_obscure_wynncraft_facts_day_2_of_14/",
      "id": 6,
      "lastSent": 0
    },
    {
      "requestedBy": "608584543506530314",
      "fact": "Going by quests in level order, the first three times in which the player kills a normal, uncorrupted person is the \"Well Witch\" in Maltic's Well at level 16, Commander Takan in The Mercenary at level 30, and the bandits in A Sandy Scandal at level 32.\n**Source:** https://www.reddit.com/r/WynnCraft/comments/s81qr4/strange_andor_obscure_wynncraft_facts_day_4_of_14/",
      "id": 7,
      "lastSent": 0
    },
    {
      "requestedBy": "608584543506530314",
      "fact": "Out of all 137 main quests, a total of exactly 40 of them have no amount of emeralds awarded to the player at the end of them, most of the time because of the circumstances of the quest or the people in it. If you're interested in which ones, a full list of those 40 quests is in the comments. Some interesting examples on the list are every quest to unlock a dungeon except for A Journey Further, and that Aldorei's Secret gives you zero emeralds only in one half, completely dependent on your choices, so while both *can* give you no emeralds, you'll only be capable of getting none from one of them.\n**Source:** https://www.reddit.com/r/WynnCraft/comments/s8u5u6/strange_andor_obscure_wynncraft_facts_day_5_of_14/",
      "id": 8,
      "lastSent": 1690560000
    },
    {
      "requestedBy": "608584543506530314",
      "fact": "Lost Sanctuary, Corrupted Lost Sanctuary, and Fallen Factory are the only dungeons that don't have a generic yellow Token item for any of their combat portions. And, along with Corrupted Underworld Crypt, they are the only dungeons in which unique tokens are used for the boss fight\n**Source:** https://www.reddit.com/r/WynnCraft/comments/s794dt/strange_andor_obscure_wynncraft_facts_day_3_of_14/",
      "id": 9,
      "lastSent": 0
    },
    {
      "requestedBy": "608584543506530314",
      "fact": "The only Tier 6 loot chest in the game exists in the Shattered Minds version of the Light Forest, but is completely inaccessible. In the normal version of the Light Forest, the actual location of the \"Tier 6 Loot Chest\" is in the Hobbit Village, where the Artefact Merchant that buys Dogedar's Ultimate Weapon is. In a way, he is like a real Tier 6 Loot Chest, considering he pays you seven LE for a completely worthless weapon.\n**Source:** https://www.reddit.com/r/WynnCraft/comments/s9m5w0/strange_andor_obscure_wynncraft_facts_day_6_of_14/",
      "id": 10,
      "lastSent": 0
    },
    {
      "requestedBy": "608584543506530314",
      "fact": "The most dangerous mob in Wynncraft, at least in terms of most possible damage, is the Panic Zealot, which can instantly take 99% of your health. However, the most dangerous *item* in Wynncraft is the Bremminglar Battle Brew, which instantly brings you to 1 hp, no matter how much health you have. With a max HP set of crafted armor, you can take over 50,000 damage in an instant.\n**Source:** https://www.reddit.com/r/WynnCraft/comments/sada8v/strange_andor_obscure_wynncraft_facts_day_7_of_14/",
      "id": 11,
      "lastSent": 1690992000
    },
    {
      "requestedBy": "608584543506530314",
      "fact": "Out of all the 39 types of hostile and neutral mobs that appear in the Silent Expanse quests, the Blinder mobs in The Olmic Rune are the only ones to make an appearance outside of a quest. However, they are still out of their normal area, as the quest has them in the Ruined Olmic City while they only appear in the Eyeball Forest.\n**Source:** https://www.reddit.com/r/WynnCraft/comments/sb55pb/strange_andor_obscure_wynncraft_facts_day_8_of_14/",
      "id": 12,
      "lastSent": 1690805943
    },
    {
      "requestedBy": "608584543506530314",
      "fact": "A fun fact about horses is that they don't gain exp based on how much you ride them, but by how much the horse itself travels. If your horse starts walking off on it's own or you just push it around by walking into it, it still gains exp. It can even level up as it just aimlessly wanders around. Though, it should be said that pushing your horse around or waiting for it to walk on its own isn't very lucrative.\n**Source:** https://www.reddit.com/r/WynnCraft/comments/sbxntu/strange_andor_obscure_wynncraft_facts_day_9_of_14/",
      "id": 13,
      "lastSent": 0
    },
    {
      "requestedBy": "608584543506530314",
      "fact": "Corrupted Underworld Crypt, Sand-Swept Tomb, and Corrupted Sand-Swept Tomb all share the second lowest required mob kill count of all dungeons, at just 5.\n**Source:** https://www.reddit.com/r/WynnCraft/comments/scp2zz/strange_andor_obscure_wynncraft_facts_day_10_of/",
      "id": 14,
      "lastSent": 1690646400
    },
    {
      "requestedBy": "894034804503351366",
      "fact": "The boss, \"Panic Zealot\" is actually an animated, hostile version of the shaman weapon of the same name. After defeating it, the player may utilize it in combat. However the weapon is nowhere near as powerful as the boss.",
      "id": 15,
      "lastSent": 0
    }
  ]
}
